salim-1997/C31--STM32F7-/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery.h"
#include <math.h>
#include <stdio.h>
#include "TimeDoctor.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc3;

CRC_HandleTypeDef hcrc;

DCMI_HandleTypeDef hdcmi;

DMA2D_HandleTypeDef hdma2d;

ETH_HandleTypeDef heth;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

IWDG_HandleTypeDef hiwdg;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;

SPDIFRX_HandleTypeDef hspdif;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

SDRAM_HandleTypeDef hsdram1;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 1024 * 4
};
/* Definitions for defaulTask */
osThreadId_t defaulTaskHandle;
const osThreadAttr_t defaulTask_attributes = {
  .name = "defaulTask",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 1024 * 4
};
/* USER CODE BEGIN PV */

osThreadId_t audioRecordingHandle;// declaration of a new  thread : audio recording task
const osThreadAttr_t audioRecording_attributes = { //creating the attributes for the audio recording thread
  .name = "AudioRec",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 4096
};

osThreadId_t audioProcessingHandle;//declaration of a new thread: the audio processing thread
const osThreadAttr_t audioProcessing_attributes = {//creating the attributes for the audio processing thread
  .name = "AudioProc",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 4096
};

osThreadId_t touchScreenHandle;// deaclaration of a new thread: the touchscreen handling thread
const osThreadAttr_t touchScreen_attributes = { //creating attributes for the thread
  .name = "touch",
  .priority = (osPriority_t) osPriorityNormal,
  .stack_size = 4096
};

osMutexId_t mutexLCD;// declaration of a new motex object
const osMutexAttr_t mutexLCD_attributes = {//creating the attributes of the mutex
		.name = "mutexLCD"
};
osMessageQueueId_t  audioQueue;//declaration of a new message queue
const osMessageQueueAttr_t audioQueue_attributes = {//attributes of the message queue
		.name = "AudioQ"
};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_ETH_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_SAI2_Init(void);
static void MX_SPDIFRX_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM12_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_IWDG_Init(void);
void StartDefaultTask(void *argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#define AUDIO_IN_SAMPLES_RATE 16000
#define AUDIO_IN_SAMPLES (AUDIO_IN_SAMPLES_RATE/10)
int16_t audio_in_buffer[AUDIO_IN_SAMPLES*2]; // L+R interleaved

void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{
	osStatus_t status = osMessageQueuePut(audioQueue, &audio_in_buffer[0] , 0 , 0);
	if(status == osErrorResource){
		//check documentation
	}
	else if (status != osOK){
		Error_Handler();
	}
}
void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
	osStatus_t status = osMessageQueuePut(audioQueue, &audio_in_buffer[AUDIO_IN_SAMPLES/2] , 0 , 0);
	if(status == osErrorResource){
		//check documentation
	}
	else if (status != osOK){
		Error_Handler();
	}
}
void BSP_AUDIO_IN_Error_CallBack(void)
{

}
void AudioRecordingFunction(void *argument) ///function of AudioReacording thread
{
	uint8_t ok;
	  ok = BSP_AUDIO_IN_Init(AUDIO_IN_SAMPLES_RATE, 16, 2);
	  if (ok != AUDIO_OK){
		  Error_Handler();
	  }
	  ok = BSP_AUDIO_IN_Record(audio_in_buffer, AUDIO_IN_SAMPLES);
	  if (ok != AUDIO_OK){
	  	  Error_Handler();
	    }
	  osThreadSuspend(audioRecordingHandle);

